## :x: Apply Result

[CI link](https://github.com/kyma-project/test-infra/actions/runs/10068116500)



<pre><code>Error: Error creating service account: googleapi: Error 409: Service account sa-gke-kyma-integration already exists within project projects/sap-kyma-prow.
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ResourceInfo&#34;,
    &#34;resourceName&#34;: &#34;projects/sap-kyma-prow/serviceAccounts/sa-gke-kyma-integration@sap-kyma-prow.iam.gserviceaccount.com&#34;
  }
]
, alreadyExists

  with google_service_account.sa-gke-kyma-integration,
  on service_accounts.tf line 1, in resource &#34;google_service_account&#34; &#34;sa-gke-kyma-integration&#34;:
   1: resource &#34;google_service_account&#34; &#34;sa-gke-kyma-integration&#34; {


Error: Error creating service account: googleapi: Error 409: Service account gcr-cleaner already exists within project projects/sap-kyma-prow.
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ResourceInfo&#34;,
    &#34;resourceName&#34;: &#34;projects/sap-kyma-prow/serviceAccounts/gcr-cleaner@sap-kyma-prow.iam.gserviceaccount.com&#34;
  }
]
, alreadyExists

  with google_service_account.gcr-cleaner,
  on service_accounts.tf line 7, in resource &#34;google_service_account&#34; &#34;gcr-cleaner&#34;:
   7: resource &#34;google_service_account&#34; &#34;gcr-cleaner&#34; {


Error: Error creating service account: googleapi: Error 409: Service account control-plane already exists within project projects/sap-kyma-prow.
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ResourceInfo&#34;,
    &#34;resourceName&#34;: &#34;projects/sap-kyma-prow/serviceAccounts/control-plane@sap-kyma-prow.iam.gserviceaccount.com&#34;
  }
]
, alreadyExists

  with google_service_account.control-plane,
  on service_accounts.tf line 13, in resource &#34;google_service_account&#34; &#34;control-plane&#34;:
  13: resource &#34;google_service_account&#34; &#34;control-plane&#34; {


Error: Error creating service account: googleapi: Error 409: Service account kyma-oci-image-builder already exists within project projects/sap-kyma-prow.
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ResourceInfo&#34;,
    &#34;resourceName&#34;: &#34;projects/sap-kyma-prow/serviceAccounts/kyma-oci-image-builder@sap-kyma-prow.iam.gserviceaccount.com&#34;
  }
]
, alreadyExists

  with google_service_account.kyma-oci-image-builder,
  on service_accounts.tf line 19, in resource &#34;google_service_account&#34; &#34;kyma-oci-image-builder&#34;:
  19: resource &#34;google_service_account&#34; &#34;kyma-oci-image-builder&#34; {


Error: Error creating service account: googleapi: Error 409: Service account sa-gardener-logs already exists within project projects/sap-kyma-prow.
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ResourceInfo&#34;,
    &#34;resourceName&#34;: &#34;projects/sap-kyma-prow/serviceAccounts/sa-gardener-logs@sap-kyma-prow.iam.gserviceaccount.com&#34;
  }
]
, alreadyExists

  with google_service_account.sa-gardener-logs,
  on service_accounts.tf line 25, in resource &#34;google_service_account&#34; &#34;sa-gardener-logs&#34;:
  25: resource &#34;google_service_account&#34; &#34;sa-gardener-logs&#34; {


Error: Error creating service account: googleapi: Error 409: Service account terraform-planner already exists within project projects/sap-kyma-prow.
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ResourceInfo&#34;,
    &#34;resourceName&#34;: &#34;projects/sap-kyma-prow/serviceAccounts/terraform-planner@sap-kyma-prow.iam.gserviceaccount.com&#34;
  }
]
, alreadyExists

  with google_service_account.terraform-planner,
  on service_accounts.tf line 31, in resource &#34;google_service_account&#34; &#34;terraform-planner&#34;:
  31: resource &#34;google_service_account&#34; &#34;terraform-planner&#34; {


Error: Error creating service account: googleapi: Error 409: Service account counduit-cli-bucket already exists within project projects/sap-kyma-prow.
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ResourceInfo&#34;,
    &#34;resourceName&#34;: &#34;projects/sap-kyma-prow/serviceAccounts/counduit-cli-bucket@sap-kyma-prow.iam.gserviceaccount.com&#34;
  }
]
, alreadyExists

  with google_service_account.counduit-cli-bucket,
  on service_accounts.tf line 37, in resource &#34;google_service_account&#34; &#34;counduit-cli-bucket&#34;:
  37: resource &#34;google_service_account&#34; &#34;counduit-cli-bucket&#34; {


Error: Error creating service account: googleapi: Error 409: Service account gencred-refresher already exists within project projects/sap-kyma-prow.
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ResourceInfo&#34;,
    &#34;resourceName&#34;: &#34;projects/sap-kyma-prow/serviceAccounts/gencred-refresher@sap-kyma-prow.iam.gserviceaccount.com&#34;
  }
]
, alreadyExists

  with google_service_account.gencred-refresher,
  on service_accounts.tf line 43, in resource &#34;google_service_account&#34; &#34;gencred-refresher&#34;:
  43: resource &#34;google_service_account&#34; &#34;gencred-refresher&#34; {


Error: Error creating service account: googleapi: Error 409: Service account sa-prowjob-gcp-logging-client already exists within project projects/sap-kyma-prow.
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ResourceInfo&#34;,
    &#34;resourceName&#34;: &#34;projects/sap-kyma-prow/serviceAccounts/sa-prowjob-gcp-logging-client@sap-kyma-prow.iam.gserviceaccount.com&#34;
  }
]
, alreadyExists

  with google_service_account.sa-prowjob-gcp-logging-client,
  on service_accounts.tf line 49, in resource &#34;google_service_account&#34; &#34;sa-prowjob-gcp-logging-client&#34;:
  49: resource &#34;google_service_account&#34; &#34;sa-prowjob-gcp-logging-client&#34; {


Error: Error creating service account: googleapi: Error 409: Service account secret-manager-trusted already exists within project projects/sap-kyma-prow.
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ResourceInfo&#34;,
    &#34;resourceName&#34;: &#34;projects/sap-kyma-prow/serviceAccounts/secret-manager-trusted@sap-kyma-prow.iam.gserviceaccount.com&#34;
  }
]
, alreadyExists

  with google_service_account.secret-manager-trusted,
  on service_accounts.tf line 55, in resource &#34;google_service_account&#34; &#34;secret-manager-trusted&#34;:
  55: resource &#34;google_service_account&#34; &#34;secret-manager-trusted&#34; {


Error: Error creating service account: googleapi: Error 409: Service account terraform-executor already exists within project projects/sap-kyma-prow.
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ResourceInfo&#34;,
    &#34;resourceName&#34;: &#34;projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com&#34;
  }
]
, alreadyExists

  with google_service_account.terraform-executor,
  on service_accounts.tf line 61, in resource &#34;google_service_account&#34; &#34;terraform-executor&#34;:
  61: resource &#34;google_service_account&#34; &#34;terraform-executor&#34; {


Error: Error creating service account: googleapi: Error 409: Service account sa-gcr-kyma-project-trusted already exists within project projects/sap-kyma-prow.
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ResourceInfo&#34;,
    &#34;resourceName&#34;: &#34;projects/sap-kyma-prow/serviceAccounts/sa-gcr-kyma-project-trusted@sap-kyma-prow.iam.gserviceaccount.com&#34;
  }
]
, alreadyExists

  with google_service_account.sa-gcr-kyma-project-trusted,
  on service_accounts.tf line 67, in resource &#34;google_service_account&#34; &#34;sa-gcr-kyma-project-trusted&#34;:
  67: resource &#34;google_service_account&#34; &#34;sa-gcr-kyma-project-trusted&#34; {


Error: Error creating service account: googleapi: Error 409: Service account sa-gcs-plank already exists within project projects/sap-kyma-prow.
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ResourceInfo&#34;,
    &#34;resourceName&#34;: &#34;projects/sap-kyma-prow/serviceAccounts/sa-gcs-plank@sap-kyma-prow.iam.gserviceaccount.com&#34;
  }
]
, alreadyExists

  with google_service_account.sa-gcs-plank,
  on service_accounts.tf line 73, in resource &#34;google_service_account&#34; &#34;sa-gcs-plank&#34;:
  73: resource &#34;google_service_account&#34; &#34;sa-gcs-plank&#34; {


Error: Error creating service account: googleapi: Error 409: Service account sa-kyma-project already exists within project projects/sap-kyma-prow.
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ResourceInfo&#34;,
    &#34;resourceName&#34;: &#34;projects/sap-kyma-prow/serviceAccounts/sa-kyma-project@sap-kyma-prow.iam.gserviceaccount.com&#34;
  }
]
, alreadyExists

  with google_service_account.sa-kyma-project,
  on service_accounts.tf line 79, in resource &#34;google_service_account&#34; &#34;sa-kyma-project&#34;:
  79: resource &#34;google_service_account&#34; &#34;sa-kyma-project&#34; {


Error: Error creating service account: googleapi: Error 409: Service account sa-prow-job-resource-cleaners already exists within project projects/sap-kyma-prow.
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ResourceInfo&#34;,
    &#34;resourceName&#34;: &#34;projects/sap-kyma-prow/serviceAccounts/sa-prow-job-resource-cleaners@sap-kyma-prow.iam.gserviceaccount.com&#34;
  }
]
, alreadyExists

  with google_service_account.sa-prow-job-resource-cleaners,
  on service_accounts.tf line 85, in resource &#34;google_service_account&#34; &#34;sa-prow-job-resource-cleaners&#34;:
  85: resource &#34;google_service_account&#34; &#34;sa-prow-job-resource-cleaners&#34; {


Error: Error creating service account: googleapi: Error 409: Service account sa-kyma-artifacts already exists within project projects/sap-kyma-prow.
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ResourceInfo&#34;,
    &#34;resourceName&#34;: &#34;projects/sap-kyma-prow/serviceAccounts/sa-kyma-artifacts@sap-kyma-prow.iam.gserviceaccount.com&#34;
  }
]
, alreadyExists

  with google_service_account.sa-kyma-artifacts,
  on service_accounts.tf line 91, in resource &#34;google_service_account&#34; &#34;sa-kyma-artifacts&#34;:
  91: resource &#34;google_service_account&#34; &#34;sa-kyma-artifacts&#34; {


Error: Error creating service account: googleapi: Error 409: Service account gitleaks-secret-accesor already exists within project projects/sap-kyma-prow.
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ResourceInfo&#34;,
    &#34;resourceName&#34;: &#34;projects/sap-kyma-prow/serviceAccounts/gitleaks-secret-accesor@sap-kyma-prow.iam.gserviceaccount.com&#34;
  }
]
, alreadyExists

  with google_service_account.gitleaks-secret-accesor,
  on service_accounts.tf line 97, in resource &#34;google_service_account&#34; &#34;gitleaks-secret-accesor&#34;:
  97: resource &#34;google_service_account&#34; &#34;gitleaks-secret-accesor&#34; {


Error: Error creating service account: googleapi: Error 409: Service account sa-secret-update already exists within project projects/sap-kyma-prow.
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ResourceInfo&#34;,
    &#34;resourceName&#34;: &#34;projects/sap-kyma-prow/serviceAccounts/sa-secret-update@sap-kyma-prow.iam.gserviceaccount.com&#34;
  }
]
, alreadyExists

  with google_service_account.sa-secret-update,
  on service_accounts.tf line 103, in resource &#34;google_service_account&#34; &#34;sa-secret-update&#34;:
 103: resource &#34;google_service_account&#34; &#34;sa-secret-update&#34; {


Error: Error creating service account: googleapi: Error 409: Service account sa-kyma-dns-serviceuser already exists within project projects/sap-kyma-prow.
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ResourceInfo&#34;,
    &#34;resourceName&#34;: &#34;projects/sap-kyma-prow/serviceAccounts/sa-kyma-dns-serviceuser@sap-kyma-prow.iam.gserviceaccount.com&#34;
  }
]
, alreadyExists

  with google_service_account.sa-kyma-dns-serviceuser,
  on service_accounts.tf line 109, in resource &#34;google_service_account&#34; &#34;sa-kyma-dns-serviceuser&#34;:
 109: resource &#34;google_service_account&#34; &#34;sa-kyma-dns-serviceuser&#34; {


Error: Error creating service account: googleapi: Error 409: Service account sa-security-dashboard-oauth already exists within project projects/sap-kyma-prow.
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ResourceInfo&#34;,
    &#34;resourceName&#34;: &#34;projects/sap-kyma-prow/serviceAccounts/sa-security-dashboard-oauth@sap-kyma-prow.iam.gserviceaccount.com&#34;
  }
]
, alreadyExists

  with google_service_account.sa-security-dashboard-oauth,
  on service_accounts.tf line 115, in resource &#34;google_service_account&#34; &#34;sa-security-dashboard-oauth&#34;:
 115: resource &#34;google_service_account&#34; &#34;sa-security-dashboard-oauth&#34; {


Error: Error creating service account: googleapi: Error 409: Service account firebase-adminsdk-udzxq already exists within project projects/sap-kyma-prow.
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ResourceInfo&#34;,
    &#34;resourceName&#34;: &#34;projects/sap-kyma-prow/serviceAccounts/firebase-adminsdk-udzxq@sap-kyma-prow.iam.gserviceaccount.com&#34;
  }
]
, alreadyExists

  with google_service_account.firebase-adminsdk-udzxq,
  on service_accounts.tf line 121, in resource &#34;google_service_account&#34; &#34;firebase-adminsdk-udzxq&#34;:
 121: resource &#34;google_service_account&#34; &#34;firebase-adminsdk-udzxq&#34; {


Error: Error creating service account: googleapi: Error 409: Service account secret-manager-untrusted already exists within project projects/sap-kyma-prow.
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ResourceInfo&#34;,
    &#34;resourceName&#34;: &#34;projects/sap-kyma-prow/serviceAccounts/secret-manager-untrusted@sap-kyma-prow.iam.gserviceaccount.com&#34;
  }
]
, alreadyExists

  with google_service_account.secret-manager-untrusted,
  on service_accounts.tf line 127, in resource &#34;google_service_account&#34; &#34;secret-manager-untrusted&#34;:
 127: resource &#34;google_service_account&#34; &#34;secret-manager-untrusted&#34; {


Error: Error creating service account: googleapi: Error 409: Service account sa-prow-deploy already exists within project projects/sap-kyma-prow.
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ResourceInfo&#34;,
    &#34;resourceName&#34;: &#34;projects/sap-kyma-prow/serviceAccounts/sa-prow-deploy@sap-kyma-prow.iam.gserviceaccount.com&#34;
  }
]
, alreadyExists

  with google_service_account.sa-prow-deploy,
  on service_accounts.tf line 133, in resource &#34;google_service_account&#34; &#34;sa-prow-deploy&#34;:
 133: resource &#34;google_service_account&#34; &#34;sa-prow-deploy&#34; {


Error: Error creating service account: googleapi: Error 409: Service account sa-dev-kyma-project already exists within project projects/sap-kyma-prow.
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ResourceInfo&#34;,
    &#34;resourceName&#34;: &#34;projects/sap-kyma-prow/serviceAccounts/sa-dev-kyma-project@sap-kyma-prow.iam.gserviceaccount.com&#34;
  }
]
, alreadyExists

  with google_service_account.sa-dev-kyma-project,
  on service_accounts.tf line 139, in resource &#34;google_service_account&#34; &#34;sa-dev-kyma-project&#34;:
 139: resource &#34;google_service_account&#34; &#34;sa-dev-kyma-project&#34; {</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
data.kubectl_file_documents.automated_approver: Reading...
data.kubectl_file_documents.automated_approver_rules: Reading...
data.kubectl_file_documents.automated_approver_rules: Read complete after 0s [id=48d07f870c26a37d3a48229fcc9cd29ae14bea83cf200e4e8326e5d755a1e790]
data.kubectl_file_documents.automated_approver: Read complete after 0s [id=9155668a04bc6d46bd1f1bd8fdfe83918a24f38a6bd93d0b830074452a2efd67]
data.github_repository.test_infra: Reading...
data.github_organization.kyma-project: Reading...
github_actions_variable.github_terraform_executor_secret_name: Refreshing state... [id=test-infra:GH_TERRAFORM_EXECUTOR_SECRET_NAME]
github_actions_variable.github_terraform_planner_secret_name: Refreshing state... [id=test-infra:GH_TERRAFORM_PLANNER_SECRET_NAME]
github_actions_organization_variable.image_builder_ado_pat_gcp_secret_name: Refreshing state... [id=IMAGE_BUILDER_ADO_PAT_GCP_SECRET_NAME]
data.github_repository.gitleaks_repository["test-infra"]: Reading...
github_actions_organization_variable.gcp_kyma_project_project_id: Refreshing state... [id=GCP_KYMA_PROJECT_PROJECT_ID]
module.github_webhook_gateway.google_service_account.github_webhook_gateway: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/github-webhook-gateway@sap-kyma-prow.iam.gserviceaccount.com]
google_pubsub_topic.secrets_rotator_dead_letter: Refreshing state... [id=projects/sap-kyma-prow/topics/secrets-rotator-dead-letter]
module.security_dashboard_token.data.google_iam_policy.noauth: Reading...
module.security_dashboard_token.data.google_iam_policy.noauth: Read complete after 0s [id=3450855414]
module.github_webhook_gateway.data.google_iam_policy.noauth: Reading...
module.slack_message_sender.google_monitoring_alert_policy.slack_message_sender: Refreshing state... [id=projects/sap-kyma-prow/alertPolicies/17360148176148949136]
module.github_webhook_gateway.data.google_iam_policy.noauth: Read complete after 0s [id=3450855414]
module.github_webhook_gateway.data.google_secret_manager_secret.webhook_token: Reading...
data.google_container_cluster.untrusted_workload_k8s_cluster: Reading...
module.github_webhook_gateway.google_pubsub_topic.issue_labeled: Refreshing state... [id=projects/sap-kyma-prow/topics/issue-labeled]
module.github_webhook_gateway.data.google_secret_manager_secret.webhook_token: Read complete after 0s [id=projects/sap-kyma-prow/secrets/sap-tools-github-backlog-webhook-secret]
data.google_container_cluster.trusted_workload_k8s_cluster: Reading...
data.google_pubsub_topic.secret-manager-notifications-topic: Reading...
google_service_account.terraform_planner: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/terraform-planner@sap-kyma-prow.iam.gserviceaccount.com]
module.slack_message_sender.google_service_account.slack_message_sender: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/slack-message-sender@sap-kyma-prow.iam.gserviceaccount.com]
module.security_dashboard_token.data.google_project.project: Reading...
data.google_pubsub_topic.secret-manager-notifications-topic: Read complete after 1s [id=projects/sap-kyma-prow/topics/secret-manager-notifications]
module.service_account_keys_cleaner.data.google_project.project: Reading...
module.slack_message_sender.data.google_secret_manager_secret.common_slack_bot_token: Reading...
module.github_webhook_gateway.data.google_project.project: Reading...
module.slack_message_sender.data.google_secret_manager_secret.common_slack_bot_token: Read complete after 0s [id=projects/sap-kyma-prow/secrets/common-slack-bot-token]
data.google_container_cluster.prow_k8s_cluster: Reading...
google_service_account.sa-prow-pubsub: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sa-prow-pubsub@sap-kyma-prow.iam.gserviceaccount.com]
data.google_client_config.gcp: Reading...
data.google_client_config.gcp: Read complete after 0s [id=projects/"sap-kyma-prow"/regions/"europe-west4"/zones/<null>]
module.github_webhook_gateway.data.google_secret_manager_secret.gh_tools_kyma_bot_token: Reading...
module.github_webhook_gateway.data.google_secret_manager_secret.gh_tools_kyma_bot_token: Read complete after 0s [id=projects/sap-kyma-prow/secrets/trusted_default_kyma-bot-github-sap-token]
google_service_account.secret-manager-prow: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/secret-manager-prow@sap-kyma-prow.iam.gserviceaccount.com]
google_service_account.sa-vm-kyma-integration: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sa-vm-kyma-integration@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_rotator.google_service_account.service_account_keys_rotator: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sa-keys-rotator@sap-kyma-prow.iam.gserviceaccount.com]
module.security_dashboard_token.data.google_project.project: Read complete after 0s [id=projects/sap-kyma-prow]
google_service_account.terraform_executor: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com]
google_dns_managed_zone.build_kyma: Refreshing state... [id=projects/sap-kyma-prow/managedZones/build-kyma]
module.cors_proxy.data.google_iam_policy.noauth: Reading...
module.cors_proxy.data.google_iam_policy.noauth: Read complete after 0s [id=3450855414]
google_service_account.secrets-rotator: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/secrets-rotator@sap-kyma-prow.iam.gserviceaccount.com]
google_service_account.sa_gke_kyma_integration: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sa-gke-kyma-integration@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_cleaner.google_service_account.service_account_keys_cleaner: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sa-keys-cleaner@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_cleaner.data.google_project.project: Read complete after 0s [id=projects/sap-kyma-prow]
module.cors_proxy.data.google_project.project: Reading...
module.cors_proxy.google_cloud_run_service.cors_proxy: Refreshing state... [id=locations/europe-west3/namespaces/sap-kyma-prow/services/cors-proxy]
google_service_account.gitleaks_secret_accesor: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/gitleaks-secret-accesor@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_rotator.data.google_project.project: Reading...
module.github_webhook_gateway.data.google_project.project: Read complete after 0s [id=projects/sap-kyma-prow]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Refreshing state... [id=locations/europe-west1/namespaces/sap-kyma-prow/services/security-dashboard-token]
data.google_container_cluster.prow_k8s_cluster: Read complete after 0s [id=projects/sap-kyma-prow/locations/europe-west3-a/clusters/prow]
google_container_cluster.trusted_workload: Refreshing state... [id=projects/sap-kyma-prow/locations/europe-west4/clusters/trusted-workload-kyma-prow]
data.github_repository.test_infra: Read complete after 1s [id=test-infra]
module.service_account_keys_rotator.google_project_service_identity.pubsub_identity_agent: Refreshing state... [id=projects/sap-kyma-prow/services/pubsub.googleapis.com]
module.artifact_registry["modules-internal"].data.google_client_config.this: Reading...
module.cors_proxy.data.google_project.project: Read complete after 0s [id=projects/sap-kyma-prow]
module.github_webhook_gateway.google_secret_manager_secret_iam_member.webhook_token_accessor: Refreshing state... [id=projects/sap-kyma-prow/secrets/sap-tools-github-backlog-webhook-secret/roles/secretmanager.secretAccessor/serviceAccount:github-webhook-gateway@sap-kyma-prow.iam.gserviceaccount.com]
data.google_container_cluster.untrusted_workload_k8s_cluster: Read complete after 1s [id=projects/sap-kyma-prow/locations/europe-west3/clusters/untrusted-workload-kyma-prow]
module.github_webhook_gateway.google_pubsub_topic_iam_binding.issue_labeled: Refreshing state... [id=projects/sap-kyma-prow/topics/issue-labeled/roles/pubsub.publisher]
data.github_repository.gitleaks_repository["test-infra"]: Read complete after 1s [id=test-infra]
google_service_account_iam_binding.terraform_planner_workload_identity: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/terraform-planner@sap-kyma-prow.iam.gserviceaccount.com/roles/iam.workloadIdentityUser]
module.artifact_registry["modules-internal"].data.google_client_config.this: Read complete after 0s [id=projects/"kyma-project"/regions/"europe-west4"/zones/<null>]
github_actions_variable.gcp_terraform_planner_service_account_email: Refreshing state... [id=test-infra:GCP_TERRAFORM_PLANNER_SERVICE_ACCOUNT_EMAIL]
module.service_account_keys_rotator.data.google_project.project: Read complete after 1s [id=projects/sap-kyma-prow]
google_storage_bucket_iam_binding.planner_state_bucket_write_access: Refreshing state... [id=b/tf-state-kyma-project/roles/storage.objectUser]
google_project_iam_member.terraform_planner_workloads_project_read_access["roles/viewer"]: Refreshing state... [id=sap-kyma-prow-workloads/roles/viewer/serviceAccount:terraform-planner@sap-kyma-prow.iam.gserviceaccount.com]
google_project_iam_member.terraform_planner_prow_project_read_access["roles/container.developer"]: Refreshing state... [id=sap-kyma-prow/roles/container.developer/serviceAccount:terraform-planner@sap-kyma-prow.iam.gserviceaccount.com]
google_project_iam_member.terraform_planner_prow_project_read_access["roles/storage.objectViewer"]: Refreshing state... [id=sap-kyma-prow/roles/storage.objectViewer/serviceAccount:terraform-planner@sap-kyma-prow.iam.gserviceaccount.com]
google_project_iam_member.terraform_planner_prow_project_read_access["roles/iam.securityReviewer"]: Refreshing state... [id=sap-kyma-prow/roles/iam.securityReviewer/serviceAccount:terraform-planner@sap-kyma-prow.iam.gserviceaccount.com]
google_project_iam_member.terraform_planner_prow_project_read_access["roles/viewer"]: Refreshing state... [id=sap-kyma-prow/roles/viewer/serviceAccount:terraform-planner@sap-kyma-prow.iam.gserviceaccount.com]
module.slack_message_sender.data.google_iam_policy.run_invoker: Reading...
module.slack_message_sender.data.google_iam_policy.run_invoker: Read complete after 0s [id=1526577908]
module.slack_message_sender.google_project_iam_member.project_run_invoker: Refreshing state... [id=sap-kyma-prow/roles/run.invoker/serviceAccount:slack-message-sender@sap-kyma-prow.iam.gserviceaccount.com]
module.slack_message_sender.google_secret_manager_secret_iam_member.slack_msg_sender_common_slack_bot_token_accessor: Refreshing state... [id=projects/sap-kyma-prow/secrets/common-slack-bot-token/roles/secretmanager.secretAccessor/serviceAccount:slack-message-sender@sap-kyma-prow.iam.gserviceaccount.com]
data.google_container_cluster.trusted_workload_k8s_cluster: Read complete after 2s [id=projects/sap-kyma-prow/locations/europe-west4/clusters/trusted-workload-kyma-prow]
module.github_webhook_gateway.google_secret_manager_secret_iam_member.gh_tools_kyma_bot_token_accessor: Refreshing state... [id=projects/sap-kyma-prow/secrets/trusted_default_kyma-bot-github-sap-token/roles/secretmanager.secretAccessor/serviceAccount:github-webhook-gateway@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_rotator.google_cloud_run_service.service_account_keys_rotator: Refreshing state... [id=locations/europe-west4/namespaces/sap-kyma-prow/services/service-account-keys-rotator]
google_project_iam_member.terraform_executor_prow_project_owner: Refreshing state... [id=sap-kyma-prow/roles/owner/serviceAccount:terraform-executor@sap-kyma-prow.iam.gserviceaccount.com]
google_project_iam_member.terraform_executor_workloads_project_owner: Refreshing state... [id=sap-kyma-prow-workloads/roles/owner/serviceAccount:terraform-executor@sap-kyma-prow.iam.gserviceaccount.com]
google_service_account_iam_binding.terraform_workload_identity: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com/roles/iam.workloadIdentityUser]
github_actions_variable.gcp_terraform_executor_service_account_email: Refreshing state... [id=test-infra:GCP_TERRAFORM_EXECUTOR_SERVICE_ACCOUNT_EMAIL]
google_project_iam_binding.dns_collector_dns_reader: Refreshing state... [id=sap-kyma-prow/roles/dns.reader]
google_project_iam_binding.dns_collector_container_analysis_occurrences_viewer: Refreshing state... [id=sap-kyma-prow/roles/containeranalysis.occurrences.viewer]
google_project_iam_binding.dns_collector_bucket_get: Refreshing state... [id=sap-kyma-prow/projects/sap-kyma-prow/roles/BucketGet]
module.service_account_keys_cleaner.google_project_iam_member.service_account_keys_cleaner_secrets_versions_manager: Refreshing state... [id=sap-kyma-prow/roles/secretmanager.secretVersionManager/serviceAccount:sa-keys-cleaner@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_cleaner.google_project_iam_member.service_account_keys_cleaner_sa_keys_admin: Refreshing state... [id=sap-kyma-prow/roles/iam.serviceAccountKeyAdmin/serviceAccount:sa-keys-cleaner@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_cleaner.google_project_iam_member.service_account_keys_cleaner_secret_viewer: Refreshing state... [id=sap-kyma-prow/roles/secretmanager.viewer/serviceAccount:sa-keys-cleaner@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_cleaner.google_cloud_run_service.service_account_keys_cleaner: Refreshing state... [id=locations/europe-west4/namespaces/sap-kyma-prow/services/service-account-keys-cleaner]
module.artifact_registry["modules-internal"].google_artifact_registry_repository.artifact_registry: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/modules-internal]
module.service_account_keys_rotator.google_project_iam_binding.pubsub_project_token_creator: Refreshing state... [id=sap-kyma-prow/roles/iam.serviceAccountTokenCreator]
module.service_account_keys_rotator.google_project_iam_member.service_account_keys_rotator: Refreshing state... [id=sap-kyma-prow/roles/iam.serviceAccountKeyAdmin/serviceAccount:sa-keys-rotator@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_rotator.google_project_iam_member.service_account_keys_rotator_secret_version_accessor: Refreshing state... [id=sap-kyma-prow/roles/secretmanager.secretAccessor/serviceAccount:sa-keys-rotator@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_rotator.google_project_iam_member.service_account_keys_rotator_secret_version_adder: Refreshing state... [id=sap-kyma-prow/roles/secretmanager.secretVersionAdder/serviceAccount:sa-keys-rotator@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_rotator.google_project_iam_member.service_account_keys_rotator_secret_version_viewer: Refreshing state... [id=sap-kyma-prow/roles/secretmanager.viewer/serviceAccount:sa-keys-rotator@sap-kyma-prow.iam.gserviceaccount.com]
module.cors_proxy.google_cloud_run_service_iam_policy.noauth: Refreshing state... [id=v1/projects/sap-kyma-prow/locations/europe-west3/services/cors-proxy]
module.security_dashboard_token.google_cloud_run_service_iam_policy.noauth: Refreshing state... [id=v1/projects/sap-kyma-prow/locations/europe-west1/services/security-dashboard-token]
module.gh_com_kyma_project_workload_identity_federation.google_iam_workload_identity_pool.main: Refreshing state... [id=projects/sap-kyma-prow/locations/global/workloadIdentityPools/github-com-kyma-project]
google_project_iam_member.service_account_keys_rotator_workloads_project: Refreshing state... [id=sap-kyma-prow-workloads/roles/iam.serviceAccountKeyAdmin/serviceAccount:sa-keys-rotator@sap-kyma-prow.iam.gserviceaccount.com]
module.slack_message_sender.google_cloud_run_service.slack_message_sender: Refreshing state... [id=locations/europe-west3/namespaces/sap-kyma-prow/services/slack-message-sender]
module.github_webhook_gateway.google_cloud_run_service.github_webhook_gateway: Refreshing state... [id=locations/europe-west3/namespaces/sap-kyma-prow/services/github-webhook-gateway]
google_project_iam_member.service_account_keys_cleaner_workloads_project: Refreshing state... [id=sap-kyma-prow-workloads/roles/iam.serviceAccountKeyAdmin/serviceAccount:sa-keys-cleaner@sap-kyma-prow.iam.gserviceaccount.com]
google_container_node_pool.prowjobs_pool: Refreshing state... [id=projects/sap-kyma-prow/locations/europe-west4/clusters/trusted-workload-kyma-prow/nodePools/prowjobs-pool]
google_container_node_pool.components_pool: Refreshing state... [id=projects/sap-kyma-prow/locations/europe-west4/clusters/trusted-workload-kyma-prow/nodePools/components-pool]
module.service_account_keys_rotator.google_cloud_run_service_iam_member.service_account_keys_rotator_invoker: Refreshing state... [id=v1/projects/sap-kyma-prow/locations/europe-west4/services/service-account-keys-rotator/roles/run.invoker/serviceAccount:secrets-rotator@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_rotator.google_pubsub_subscription.service_account_keys_rotator: Refreshing state... [id=projects/sap-kyma-prow/subscriptions/secrets-rotator-service-account-keys-rotator]
data.github_organization.kyma-project: Read complete after 5s [id=39153523]
module.prow_gatekeeper.data.kubectl_file_documents.gatekeeper: Reading...
kubectl_manifest.automated_approver_rules["/api/v1/namespaces/default/configmaps/automated-approver-rules"]: Refreshing state... [id=/api/v1/namespaces/default/configmaps/automated-approver-rules]
module.prow_gatekeeper.data.kubectl_path_documents.constraints_path["../../../../prow/cluster/resources/gatekeeper-constraints/prow/**.yaml"]: Reading...
module.prow_gatekeeper.data.kubectl_path_documents.constraints_path["../../../../prow/cluster/resources/gatekeeper-constraints/prow/**.yaml"]: Read complete after 0s [id=fe6c196204f8952d3d6e65206e74a3fa6119f7817849a35ede28516d8bd3591b]
kubectl_manifest.automated_approver["/api/v1/namespaces/default/services/automated-approver"]: Refreshing state... [id=/api/v1/namespaces/default/services/automated-approver]
module.prow_gatekeeper.data.kubectl_file_documents.gatekeeper: Read complete after 0s [id=dd3443633a39325c8656d232ea51eb8515040007156fb9e6433fddd5276456b6]
kubectl_manifest.automated_approver["/apis/apps/v1/namespaces/default/deployments/automated-approver"]: Refreshing state... [id=/apis/apps/v1/namespaces/default/deployments/automated-approver]
module.prow_gatekeeper.data.kubectl_path_documents.constraint_templates_path["../../../../opa/gatekeeper/constraint-templates/**.yaml"]: Reading...
kubernetes_network_policy.hook_to_plugins: Refreshing state... [id=default/hook-to-plugins-network-policy]
module.prow_gatekeeper.data.kubectl_path_documents.constraint_templates_path["../../../../opa/gatekeeper/constraint-templates/**.yaml"]: Read complete after 0s [id=e50de6cd8b3d11489bad14b87ac5c305505c8ac8753f18797b8b9f540973419a]
kubernetes_network_policy.prow_cluster_default: Refreshing state... [id=default/prow-cluster-default-network-policy]
kubernetes_network_policy.prow_allow_http_events: Refreshing state... [id=default/prow-allow-http-events]
module.untrusted_workload_gatekeeper.data.kubectl_file_documents.gatekeeper: Reading...
module.untrusted_workload_gatekeeper.data.kubectl_path_documents.constraints_path["../../../../prow/cluster/resources/gatekeeper-constraints/untrusted/**.yaml"]: Reading...
module.untrusted_workload_gatekeeper.data.kubectl_path_documents.constraints_path["../../../../prow/cluster/resources/gatekeeper-constraints/untrusted/**.yaml"]: Read complete after 0s [id=e3b0c44298fc1c149afbf4c8996fb92427ae41e4649b934ca495991b7852b855]
module.untrusted_workload_gatekeeper.data.kubectl_path_documents.constraints_path["../../../../prow/cluster/resources/gatekeeper-constraints/workloads/**.yaml"]: Reading...
module.untrusted_workload_gatekeeper.data.kubectl_path_documents.constraints_path["../../../../prow/cluster/reso

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

ed     = false
      + display_name = "sa-security-dashboard-oauth"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.secret-manager-trusted will be created
  + resource "google_service_account" "secret-manager-trusted" {
      + account_id   = "secret-manager-trusted"
      + description  = "Will be removed with Prow"
      + disabled     = false
      + display_name = "secret-manager-trusted"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.secret-manager-untrusted will be created
  + resource "google_service_account" "secret-manager-untrusted" {
      + account_id   = "secret-manager-untrusted"
      + description  = "Will be deleted with Prow"
      + disabled     = false
      + display_name = "secret-manager-untrusted"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.terraform-executor will be created
  + resource "google_service_account" "terraform-executor" {
      + account_id   = "terraform-executor"
      + description  = "Identity of terraform executor. It's mapped to k8s service account through workload identity."
      + disabled     = false
      + display_name = "terraform-executor"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.terraform-planner will be created
  + resource "google_service_account" "terraform-planner" {
      + account_id   = "terraform-planner"
      + description  = "Identity of terraform planner"
      + disabled     = false
      + display_name = "terraform-planner"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # module.service_account_keys_cleaner.google_cloud_scheduler_job.service_account_keys_cleaner will be updated in-place
  ~ resource "google_cloud_scheduler_job" "service_account_keys_cleaner" {
        id               = "projects/sap-kyma-prow/locations/europe-west3/jobs/service-account-keys-cleaner"
        name             = "service-account-keys-cleaner"
        # (8 unchanged attributes hidden)

      ~ http_target {
          ~ uri         = "https://service-account-keys-cleaner-q25ja7ch3q-ez.a.run.app/?project=sap-kyma-prow&age=24" -> "https://service-account-keys-cleaner-q25ja7ch3q-ez.a.run.app?project=sap-kyma-prow&age=24"
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

Plan: 24 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  ~ service_account_keys_cleaner                        = {
      ~ service_account_keys_cleaner_secheduler        = {
          ~ http_target            = [
              ~ {
                  ~ uri         = "https://service-account-keys-cleaner-q25ja7ch3q-ez.a.run.app/?project=sap-kyma-prow&age=24" -> "https://service-account-keys-cleaner-q25ja7ch3q-ez.a.run.app?project=sap-kyma-prow&age=24"
                    # (5 unchanged attributes hidden)
                },
            ]
            id                     = "projects/sap-kyma-prow/locations/europe-west3/jobs/service-account-keys-cleaner"
            name                   = "service-account-keys-cleaner"
            # (12 unchanged attributes hidden)
        }
        # (2 unchanged attributes hidden)
    }
google_service_account.secret-manager-trusted: Creating...
google_service_account.sa-gcr-kyma-project-trusted: Creating...
google_service_account.terraform-planner: Creating...
google_service_account.sa-gcs-plank: Creating...
google_service_account.sa-kyma-project: Creating...
google_service_account.sa-secret-update: Creating...
google_service_account.sa-prow-job-resource-cleaners: Creating...
google_service_account.sa-kyma-dns-serviceuser: Creating...
google_service_account.counduit-cli-bucket: Creating...
google_service_account.gitleaks-secret-accesor: Creating...
google_service_account.gencred-refresher: Creating...
google_service_account.sa-prowjob-gcp-logging-client: Creating...
google_service_account.secret-manager-untrusted: Creating...
google_service_account.kyma-oci-image-builder: Creating...
google_service_account.gcr-cleaner: Creating...
google_service_account.sa-prow-deploy: Creating...
google_service_account.sa-gardener-logs: Creating...
google_service_account.sa-dev-kyma-project: Creating...
google_service_account.sa-gke-kyma-integration: Creating...
google_service_account.firebase-adminsdk-udzxq: Creating...
google_service_account.sa-kyma-artifacts: Creating...
google_service_account.control-plane: Creating...
google_service_account.terraform-executor: Creating...
google_service_account.sa-security-dashboard-oauth: Creating...
module.service_account_keys_cleaner.google_cloud_scheduler_job.service_account_keys_cleaner: Modifying... [id=projects/sap-kyma-prow/locations/europe-west3/jobs/service-account-keys-cleaner]
module.service_account_keys_cleaner.google_cloud_scheduler_job.service_account_keys_cleaner: Modifications complete after 6s [id=projects/sap-kyma-prow/locations/europe-west3/jobs/service-account-keys-cleaner]

Error: Error creating service account: googleapi: Error 409: Service account sa-gke-kyma-integration already exists within project projects/sap-kyma-prow.
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.ResourceInfo",
    "resourceName": "projects/sap-kyma-prow/serviceAccounts/sa-gke-kyma-integration@sap-kyma-prow.iam.gserviceaccount.com"
  }
]
, alreadyExists

  with google_service_account.sa-gke-kyma-integration,
  on service_accounts.tf line 1, in resource "google_service_account" "sa-gke-kyma-integration":
   1: resource "google_service_account" "sa-gke-kyma-integration" {


Error: Error creating service account: googleapi: Error 409: Service account gcr-cleaner already exists within project projects/sap-kyma-prow.
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.ResourceInfo",
    "resourceName": "projects/sap-kyma-prow/serviceAccounts/gcr-cleaner@sap-kyma-prow.iam.gserviceaccount.com"
  }
]
, alreadyExists

  with google_service_account.gcr-cleaner,
  on service_accounts.tf line 7, in resource "google_service_account" "gcr-cleaner":
   7: resource "google_service_account" "gcr-cleaner" {


Error: Error creating service account: googleapi: Error 409: Service account control-plane already exists within project projects/sap-kyma-prow.
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.ResourceInfo",
    "resourceName": "projects/sap-kyma-prow/serviceAccounts/control-plane@sap-kyma-prow.iam.gserviceaccount.com"
  }
]
, alreadyExists

  with google_service_account.control-plane,
  on service_accounts.tf line 13, in resource "google_service_account" "control-plane":
  13: resource "google_service_account" "control-plane" {


Error: Error creating service account: googleapi: Error 409: Service account kyma-oci-image-builder already exists within project projects/sap-kyma-prow.
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.ResourceInfo",
    "resourceName": "projects/sap-kyma-prow/serviceAccounts/kyma-oci-image-builder@sap-kyma-prow.iam.gserviceaccount.com"
  }
]
, alreadyExists

  with google_service_account.kyma-oci-image-builder,
  on service_accounts.tf line 19, in resource "google_service_account" "kyma-oci-image-builder":
  19: resource "google_service_account" "kyma-oci-image-builder" {


Error: Error creating service account: googleapi: Error 409: Service account sa-gardener-logs already exists within project projects/sap-kyma-prow.
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.ResourceInfo",
    "resourceName": "projects/sap-kyma-prow/serviceAccounts/sa-gardener-logs@sap-kyma-prow.iam.gserviceaccount.com"
  }
]
, alreadyExists

  with google_service_account.sa-gardener-logs,
  on service_accounts.tf line 25, in resource "google_service_account" "sa-gardener-logs":
  25: resource "google_service_account" "sa-gardener-logs" {


Error: Error creating service account: googleapi: Error 409: Service account terraform-planner already exists within project projects/sap-kyma-prow.
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.ResourceInfo",
    "resourceName": "projects/sap-kyma-prow/serviceAccounts/terraform-planner@sap-kyma-prow.iam.gserviceaccount.com"
  }
]
, alreadyExists

  with google_service_account.terraform-planner,
  on service_accounts.tf line 31, in resource "google_service_account" "terraform-planner":
  31: resource "google_service_account" "terraform-planner" {


Error: Error creating service account: googleapi: Error 409: Service account counduit-cli-bucket already exists within project projects/sap-kyma-prow.
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.ResourceInfo",
    "resourceName": "projects/sap-kyma-prow/serviceAccounts/counduit-cli-bucket@sap-kyma-prow.iam.gserviceaccount.com"
  }
]
, alreadyExists

  with google_service_account.counduit-cli-bucket,
  on service_accounts.tf line 37, in resource "google_service_account" "counduit-cli-bucket":
  37: resource "google_service_account" "counduit-cli-bucket" {


Error: Error creating service account: googleapi: Error 409: Service account gencred-refresher already exists within project projects/sap-kyma-prow.
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.ResourceInfo",
    "resourceName": "projects/sap-kyma-prow/serviceAccounts/gencred-refresher@sap-kyma-prow.iam.gserviceaccount.com"
  }
]
, alreadyExists

  with google_service_account.gencred-refresher,
  on service_accounts.tf line 43, in resource "google_service_account" "gencred-refresher":
  43: resource "google_service_account" "gencred-refresher" {


Error: Error creating service account: googleapi: Error 409: Service account sa-prowjob-gcp-logging-client already exists within project projects/sap-kyma-prow.
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.ResourceInfo",
    "resourceName": "projects/sap-kyma-prow/serviceAccounts/sa-prowjob-gcp-logging-client@sap-kyma-prow.iam.gserviceaccount.com"
  }
]
, alreadyExists

  with google_service_account.sa-prowjob-gcp-logging-client,
  on service_accounts.tf line 49, in resource "google_service_account" "sa-prowjob-gcp-logging-client":
  49: resource "google_service_account" "sa-prowjob-gcp-logging-client" {


Error: Error creating service account: googleapi: Error 409: Service account secret-manager-trusted already exists within project projects/sap-kyma-prow.
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.ResourceInfo",
    "resourceName": "projects/sap-kyma-prow/serviceAccounts/secret-manager-trusted@sap-kyma-prow.iam.gserviceaccount.com"
  }
]
, alreadyExists

  with google_service_account.secret-manager-trusted,
  on service_accounts.tf line 55, in resource "google_service_account" "secret-manager-trusted":
  55: resource "google_service_account" "secret-manager-trusted" {


Error: Error creating service account: googleapi: Error 409: Service account terraform-executor already exists within project projects/sap-kyma-prow.
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.ResourceInfo",
    "resourceName": "projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com"
  }
]
, alreadyExists

  with google_service_account.terraform-executor,
  on service_accounts.tf line 61, in resource "google_service_account" "terraform-executor":
  61: resource "google_service_account" "terraform-executor" {


Error: Error creating service account: googleapi: Error 409: Service account sa-gcr-kyma-project-trusted already exists within project projects/sap-kyma-prow.
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.ResourceInfo",
    "resourceName": "projects/sap-kyma-prow/serviceAccounts/sa-gcr-kyma-project-trusted@sap-kyma-prow.iam.gserviceaccount.com"
  }
]
, alreadyExists

  with google_service_account.sa-gcr-kyma-project-trusted,
  on service_accounts.tf line 67, in resource "google_service_account" "sa-gcr-kyma-project-trusted":
  67: resource "google_service_account" "sa-gcr-kyma-project-trusted" {


Error: Error creating service account: googleapi: Error 409: Service account sa-gcs-plank already exists within project projects/sap-kyma-prow.
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.ResourceInfo",
    "resourceName": "projects/sap-kyma-prow/serviceAccounts/sa-gcs-plank@sap-kyma-prow.iam.gserviceaccount.com"
  }
]
, alreadyExists

  with google_service_account.sa-gcs-plank,
  on service_accounts.tf line 73, in resource "google_service_account" "sa-gcs-plank":
  73: resource "google_service_account" "sa-gcs-plank" {


Error: Error creating service account: googleapi: Error 409: Service account sa-kyma-project already exists within project projects/sap-kyma-prow.
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.ResourceInfo",
    "resourceName": "projects/sap-kyma-prow/serviceAccounts/sa-kyma-project@sap-kyma-prow.iam.gserviceaccount.com"
  }
]
, alreadyExists

  with google_service_account.sa-kyma-project,
  on service_accounts.tf line 79, in resource "google_service_account" "sa-kyma-project":
  79: resource "google_service_account" "sa-kyma-project" {


Error: Error creating service account: googleapi: Error 409: Service account sa-prow-job-resource-cleaners already exists within project projects/sap-kyma-prow.
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.ResourceInfo",
    "resourceName": "projects/sap-kyma-prow/serviceAccounts/sa-prow-job-resource-cleaners@sap-kyma-prow.iam.gserviceaccount.com"
  }
]
, alreadyExists

  with google_service_account.sa-prow-job-resource-cleaners,
  on service_accounts.tf line 85, in resource "google_service_account" "sa-prow-job-resource-cleaners":
  85: resource "google_service_account" "sa-prow-job-resource-cleaners" {


Error: Error creating service account: googleapi: Error 409: Service account sa-kyma-artifacts already exists within project projects/sap-kyma-prow.
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.ResourceInfo",
    "resourceName": "projects/sap-kyma-prow/serviceAccounts/sa-kyma-artifacts@sap-kyma-prow.iam.gserviceaccount.com"
  }
]
, alreadyExists

  with google_service_account.sa-kyma-artifacts,
  on service_accounts.tf line 91, in resource "google_service_account" "sa-kyma-artifacts":
  91: resource "google_service_account" "sa-kyma-artifacts" {


Error: Error creating service account: googleapi: Error 409: Service account gitleaks-secret-accesor already exists within project projects/sap-kyma-prow.
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.ResourceInfo",
    "resourceName": "projects/sap-kyma-prow/serviceAccounts/gitleaks-secret-accesor@sap-kyma-prow.iam.gserviceaccount.com"
  }
]
, alreadyExists

  with google_service_account.gitleaks-secret-accesor,
  on service_accounts.tf line 97, in resource "google_service_account" "gitleaks-secret-accesor":
  97: resource "google_service_account" "gitleaks-secret-accesor" {


Error: Error creating service account: googleapi: Error 409: Service account sa-secret-update already exists within project projects/sap-kyma-prow.
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.ResourceInfo",
    "resourceName": "projects/sap-kyma-prow/serviceAccounts/sa-secret-update@sap-kyma-prow.iam.gserviceaccount.com"
  }
]
, alreadyExists

  with google_service_account.sa-secret-update,
  on service_accounts.tf line 103, in resource "google_service_account" "sa-secret-update":
 103: resource "google_service_account" "sa-secret-update" {


Error: Error creating service account: googleapi: Error 409: Service account sa-kyma-dns-serviceuser already exists within project projects/sap-kyma-prow.
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.ResourceInfo",
    "resourceName": "projects/sap-kyma-prow/serviceAccounts/sa-kyma-dns-serviceuser@sap-kyma-prow.iam.gserviceaccount.com"
  }
]
, alreadyExists

  with google_service_account.sa-kyma-dns-serviceuser,
  on service_accounts.tf line 109, in resource "google_service_account" "sa-kyma-dns-serviceuser":
 109: resource "google_service_account" "sa-kyma-dns-serviceuser" {


Error: Error creating service account: googleapi: Error 409: Service account sa-security-dashboard-oauth already exists within project projects/sap-kyma-prow.
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.ResourceInfo",
    "resourceName": "projects/sap-kyma-prow/serviceAccounts/sa-security-dashboard-oauth@sap-kyma-prow.iam.gserviceaccount.com"
  }
]
, alreadyExists

  with google_service_account.sa-security-dashboard-oauth,
  on service_accounts.tf line 115, in resource "google_service_account" "sa-security-dashboard-oauth":
 115: resource "google_service_account" "sa-security-dashboard-oauth" {


Error: Error creating service account: googleapi: Error 409: Service account firebase-adminsdk-udzxq already exists within project projects/sap-kyma-prow.
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.ResourceInfo",
    "resourceName": "projects/sap-kyma-prow/serviceAccounts/firebase-adminsdk-udzxq@sap-kyma-prow.iam.gserviceaccount.com"
  }
]
, alreadyExists

  with google_service_account.firebase-adminsdk-udzxq,
  on service_accounts.tf line 121, in resource "google_service_account" "firebase-adminsdk-udzxq":
 121: resource "google_service_account" "firebase-adminsdk-udzxq" {


Error: Error creating service account: googleapi: Error 409: Service account secret-manager-untrusted already exists within project projects/sap-kyma-prow.
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.ResourceInfo",
    "resourceName": "projects/sap-kyma-prow/serviceAccounts/secret-manager-untrusted@sap-kyma-prow.iam.gserviceaccount.com"
  }
]
, alreadyExists

  with google_service_account.secret-manager-untrusted,
  on service_accounts.tf line 127, in resource "google_service_account" "secret-manager-untrusted":
 127: resource "google_service_account" "secret-manager-untrusted" {


Error: Error creating service account: googleapi: Error 409: Service account sa-prow-deploy already exists within project projects/sap-kyma-prow.
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.ResourceInfo",
    "resourceName": "projects/sap-kyma-prow/serviceAccounts/sa-prow-deploy@sap-kyma-prow.iam.gserviceaccount.com"
  }
]
, alreadyExists

  with google_service_account.sa-prow-deploy,
  on service_accounts.tf line 133, in resource "google_service_account" "sa-prow-deploy":
 133: resource "google_service_account" "sa-prow-deploy" {


Error: Error creating service account: googleapi: Error 409: Service account sa-dev-kyma-project already exists within project projects/sap-kyma-prow.
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.ResourceInfo",
    "resourceName": "projects/sap-kyma-prow/serviceAccounts/sa-dev-kyma-project@sap-kyma-prow.iam.gserviceaccount.com"
  }
]
, alreadyExists

  with google_service_account.sa-dev-kyma-project,
  on service_accounts.tf line 139, in resource "google_service_account" "sa-dev-kyma-project":
 139: resource "google_service_account" "sa-dev-kyma-project" {


```

</details>

`

<!-- github-comment: {"Command":"apply","JobName":"post-apply-prod-terraform","PRNumber":11437,"Program":"tfcmt","SHA1":"3356ee9733d51f80b44f89d966b91f7820016f24","Vars":{},"WorkflowName":"Post Apply Prod Terraform"} -->